src/main/resources/testRequestsXML/request3.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://generated.soapexample.com">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:downloadMessageRequest>
            <gs:randomInt>150</gs:randomInt>
        </gs:downloadMessageRequest>
    </soapenv:Body>
</soapenv:Envelope>